pdshelley/HALGEN/atdf/ATmegaS64M1.atdf
        <register caption="CAN Status Interrupt MOb Register 1 (empty)" name="CANSIT1" offset="0xE1" size="1" mask="0x00" ocd-rw=""/>
        <register caption="CAN Bit Timing Register 1" name="CANBT1" offset="0xE2" size="1">
          <bitfield caption="Baud Rate Prescaler bits" mask="0x7E" name="BRP"/>
        </register>
        <register caption="CAN Bit Timing Register 2" name="CANBT2" offset="0xE3" size="1">
          <bitfield caption="Re-Sync Jump Width bits" mask="0x60" name="SJW"/>
          <bitfield caption="Propagation Time Segment bits" mask="0x0E" name="PRS"/>
        </register>
        <register caption="CAN Bit Timing Register 3" name="CANBT3" offset="0xE4" size="1">
          <bitfield caption="Phase Segment 2 bits" mask="0x70" name="PHS2"/>
          <bitfield caption="Phase Segment 1 bits" mask="0x0E" name="PHS1"/>
          <bitfield caption="Sample Type" mask="0x01" name="SMP"/>
        </register>
        <register caption="Timer Control Register" name="CANTCON" offset="0xE5" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="Timer Register" name="CANTIM" offset="0xE6" size="2" mask="0xFFFF" ocd-rw=""/>
        <register caption="TTC Timer Register" name="CANTTC" offset="0xE8" size="2" mask="0xFFFF" ocd-rw=""/>
        <register caption="Transmit Error Counter Register" name="CANTEC" offset="0xEA" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="Receive Error Counter Register" name="CANREC" offset="0xEB" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="Highest Priority MOb Register" name="CANHPMOB" offset="0xEC" size="1">
          <bitfield caption="Highest Priority MOb Number bits" mask="0xF0" name="HPMOB"/>
          <bitfield caption="CAN General Purpose bits" mask="0x0F" name="CGP"/>
        </register>
        <register caption="Page MOb Register" name="CANPAGE" offset="0xED" size="1">
          <bitfield caption="MOb Number bits" mask="0xF0" name="MOBNB"/>
          <bitfield caption="MOb Data Buffer Auto Increment (Active Low)" mask="0x08" name="AINC"/>
          <bitfield caption="Data Buffer Index bits" mask="0x07" name="INDX"/>
        </register>
        <register caption="MOb Status Register" name="CANSTMOB" offset="0xEE" size="1">
          <bitfield caption="Data Length Code Warning on MOb" mask="0x80" name="DLCW"/>
          <bitfield caption="Transmit OK on MOb" mask="0x40" name="TXOK"/>
          <bitfield caption="Receive OK on MOb" mask="0x20" name="RXOK"/>
          <bitfield caption="Bit Error on MOb" mask="0x10" name="BERR"/>
          <bitfield caption="Stuff Error on MOb" mask="0x08" name="SERR"/>
          <bitfield caption="CRC Error on MOb" mask="0x04" name="CERR"/>
          <bitfield caption="Form Error on MOb" mask="0x02" name="FERR"/>
          <bitfield caption="Acknowledgement Error on MOb" mask="0x01" name="AERR"/>
        </register>
        <register caption="MOb Control and DLC Register" name="CANCDMOB" offset="0xEF" size="1">
          <bitfield caption="MOb Config bits" mask="0xC0" name="CONMOB"/>
          <bitfield caption="Reply Valid" mask="0x20" name="RPLV"/>
          <bitfield caption="Identifier Extension" mask="0x10" name="IDE"/>
          <bitfield caption="Data Length Code bits" mask="0x0F" name="DLC"/>
        </register>
        <register caption="Identifier Tag Register 4" name="CANIDT4" offset="0xF0" size="1">
          <bitfield caption="Identifier Tag" mask="0xF8" name="IDT"/>
          <bitfield caption="Remote Transmission Request Tag" mask="0x04" name="RTRTAG"/>
          <bitfield caption="Reserved Bit 1 Tag" mask="0x02" name="RB1TAG"/>
          <bitfield caption="Reserved Bit 0 Tag" mask="0x01" name="RB0TAG"/>
        </register>
        <register caption="Identifier Tag Register 3" name="CANIDT3" offset="0xF1" size="1" mask="0xFF">
          <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="5"/>
        </register>
        <register caption="Identifier Tag Register 2" name="CANIDT2" offset="0xF2" size="1" mask="0xFF">
          <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="13"/>
        </register>
        <register caption="Identifier Tag Register 1" name="CANIDT1" offset="0xF3" size="1" mask="0xFF">
          <bitfield caption="Identifier Tag" mask="0xFF" name="IDT" lsb="21"/>
        </register>
        <register caption="Identifier Mask Register 4" name="CANIDM4" offset="0xF4" size="1" mask="0xFD">
          <bitfield caption="Identifier Extension Mask" mask="0x01" name="IDEMSK"/>
          <bitfield caption="Remote Transmission Request Mask" mask="0x04" name="RTRMSK"/>
          <bitfield caption="Identifier Mask" mask="0xF8" name="IDMSK"/>
        </register>
        <register caption="Identifier Mask Register 3" name="CANIDM3" offset="0xF5" size="1" mask="0xFF">
          <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="5"/>
        </register>
        <register caption="Identifier Mask Register 2" name="CANIDM2" offset="0xF6" size="1" mask="0xFF">
          <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="13"/>
        </register>
        <register caption="Identifier Mask Register 1" name="CANIDM1" offset="0xF7" size="1" mask="0xFF">
          <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="21"/>
        </register>
        <register caption="Time Stamp Register" name="CANSTM" offset="0xF8" size="2" mask="0xFFFF"/>
        <register caption="Message Data Register" name="CANMSG" offset="0xFA" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="Analog Comparator 0 Control Register" name="AC0CON" offset="0x94" size="1">
          <bitfield caption="Analog Comparator 0 Enable Bit" mask="0x80" name="AC0EN"/>
          <bitfield caption="Analog Comparator 0 Interrupt Enable Bit" mask="0x40" name="AC0IE"/>
          <bitfield caption="Analog Comparator 0  Interrupt Select Bits" mask="0x30" name="AC0IS"/>
          <bitfield caption="Analog Comparator Clock Select" mask="0x08" name="ACCKSEL"/>
          <bitfield caption="Analog Comparator 0 Multiplexer Register" mask="0x07" name="AC0M"/>
        </register>
        <register caption="Analog Comparator 1 Control Register" name="AC1CON" offset="0x95" size="1">
          <bitfield caption="Analog Comparator 1 Enable Bit" mask="0x80" name="AC1EN"/>
          <bitfield caption="Analog Comparator 1 Interrupt Enable Bit" mask="0x40" name="AC1IE"/>
          <bitfield caption="Analog Comparator 1  Interrupt Select Bit" mask="0x30" name="AC1IS" values="ANALOG_COMP_INTERRUPT"/>
          <bitfield caption="Analog Comparator 1 Interrupt Capture Enable Bit" mask="0x08" name="AC1ICE"/>
          <bitfield caption="Analog Comparator 1 Multiplexer Register" mask="0x07" name="AC1M"/>
        </register>
        <register caption="Analog Comparator 2 Control Register" name="AC2CON" offset="0x96" size="1">
          <bitfield caption="Analog Comparator 2 Enable Bit" mask="0x80" name="AC2EN"/>
          <bitfield caption="Analog Comparator 2 Interrupt Enable Bit" mask="0x40" name="AC2IE"/>
          <bitfield caption="Analog Comparator 2  Interrupt Select Bit" mask="0x30" name="AC2IS" values="ANALOG_COMP_INTERRUPT"/>
          <bitfield caption="Analog Comparator 2 Multiplexer Register" mask="0x07" name="AC2M"/>
        </register>
        <register caption="Analog Comparator 3 Control Register" name="AC3CON" offset="0x97" size="1">
          <bitfield caption="Analog Comparator 3 Enable Bit" mask="0x80" name="AC3EN"/>
          <bitfield caption="Analog Comparator 3 Interrupt Enable Bit" mask="0x40" name="AC3IE"/>
          <bitfield caption="Analog Comparator 3  Interrupt Select Bit" mask="0x30" name="AC3IS" values="ANALOG_COMP_INTERRUPT"/>
          <bitfield caption="Analog Comparator 3 Multiplexer Register" mask="0x07" name="AC3M"/>
        </register>
        <register caption="Analog Comparator Status Register" name="ACSR" offset="0x50" size="1" ocd-rw="R">
          <bitfield caption="Analog Comparator 3 Interrupt Flag Bit" mask="0x80" name="AC3IF"/>
          <bitfield caption="Analog Comparator 2 Interrupt Flag Bit" mask="0x40" name="AC2IF"/>
          <bitfield caption="Analog Comparator 1  Interrupt Flag Bit" mask="0x20" name="AC1IF"/>
          <bitfield caption="Analog Comparator 0 Interrupt Flag Bit" mask="0x10" name="AC0IF"/>
          <bitfield caption="Analog Comparator 3 Output Bit" mask="0x08" name="AC3O"/>
          <bitfield caption="Analog Comparator 2 Output Bit" mask="0x04" name="AC2O"/>
          <bitfield caption="Analog Comparator 1 Output Bit" mask="0x02" name="AC1O"/>
          <bitfield caption="Analog Comparator 0 Output Bit" mask="0x01" name="AC0O"/>
        </register>
      </register-group>
      <value-group name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="INTERRUPT_ON_TOGGLE" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="INTERRUPT_ON_FALLING_EDGE" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="INTERRUPT_ON_RISING_EDGE" value="0x03"/>
      </value-group>
    </module>
