pdshelley/HALGEN/atdf/ATmegaS64M1.atdf
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
          <bitfield caption="Current Source Enable" mask="0x40" name="ISRCEN"/>
          <bitfield caption="Analog Reference pin Enable" mask="0x20" name="AREFEN"/>
          <bitfield caption="ADC Auto Trigger Sources" mask="0x0F" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER_4BITS"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
          <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
          <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
          <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
          <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
          <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
          <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR1" offset="0x7F" size="1">
          <bitfield caption="AMP2P Pin Digital input Disable" mask="0x40" name="AMP2PD"/>
          <bitfield caption="ACMP0 Pin Digital input Disable" mask="0x20" name="ACMP0D"/>
          <bitfield caption="AMP0P Pin Digital input Disable" mask="0x10" name="AMP0PD"/>
          <bitfield caption="AMP0N Pin Digital input Disable" mask="0x08" name="AMP0ND"/>
          <bitfield caption="ADC10 Pin Digital input Disable" mask="0x04" name="ADC10D"/>
          <bitfield caption="ADC9 Pin Digital input Disable" mask="0x02" name="ADC9D"/>
          <bitfield caption="ADC8 Pin Digital input Disable" mask="0x01" name="ADC8D"/>
        </register>
        <register caption="Amplifier 0 Control and Status Register" name="AMP0CSR" offset="0x75" size="1">
          <bitfield caption="Amplifier 0 Enable" mask="0x80" name="AMP0EN"/>
          <bitfield caption="Amplifier 0 Input Shunt" mask="0x40" name="AMP0IS"/>
          <bitfield caption="Amplifier 0 Gain Selection" mask="0x30" name="AMP0G"/>
          <bitfield caption="Amplifier 0 - Comparator 0 connection" mask="0x08" name="AMPCMP0"/>
          <bitfield caption="Amplifier 0 Clock Source Selection" mask="0x07" name="AMP0TS"/>
        </register>
        <register caption="Amplifier 1 Control and Status Register" name="AMP1CSR" offset="0x76" size="1">
          <bitfield caption="Amplifier 1 Enable" mask="0x80" name="AMP1EN"/>
          <bitfield caption="Amplifier 1 Input Shunt" mask="0x40" name="AMP1IS"/>
          <bitfield caption="Amplifier 1 Gain Selection" mask="0x30" name="AMP1G"/>
          <bitfield caption="Amplifier 1 - Comparator 1 Connection" mask="0x08" name="AMPCMP1"/>
          <bitfield caption="Amplifier 1 Clock Source Selection" mask="0x07" name="AMP1TS"/>
        </register>
        <register caption="Amplifier 2 Control and Status Register" name="AMP2CSR" offset="0x77" size="1">
          <bitfield caption="Amplifier 2 Enable" mask="0x80" name="AMP2EN"/>
          <bitfield caption="Amplifier 2 Input Shunt" mask="0x40" name="AMP2IS"/>
          <bitfield caption="Amplifier 2 Gain Selection" mask="0x30" name="AMP2G"/>
          <bitfield caption="Amplifier 2 - Comparator 2 Connection" mask="0x08" name="AMPCMP2"/>
          <bitfield caption="Amplifier 2 Clock Source Selection" mask="0x07" name="AMP2TS"/>
        </register>
      </register-group>
      <value-group name="ANALOG_ADC_V_REF2">
        <value caption="AREF, Internal Vref turned off" name="AREF_INTERNAL_VREF_TURNED_OFF" value="0x00"/>
        <value caption="AVCC reference" name="AVCC_REFERENCE" value="0x01"/>
        <value caption="Reserved" name="RESERVED" value="0x02"/>
        <value caption="Internal 2.56V Voltage Reference" name="INTERNAL_2_56V_VOLTAGE_REFERENCE" value="0x03"/>
      </value-group>
      <value-group name="ANALOG_ADC_AUTO_TRIGGER_4BITS">
        <value caption="Free Running mode" name="FREE_RUNNING_MODE" value="0x00"/>
        <value caption="Analog Comparator" name="ANALOG_COMPARATOR" value="0x01"/>
        <value caption="External Interrupt Request 0" name="EXTERNAL_INTERRUPT_REQUEST_0" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="TIMER_COUNTER0_COMPARE_MATCH_A" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="TIMER_COUNTER0_OVERFLOW" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="TIMER_COUNTER1_COMPARE_MATCH_B" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="TIMER_COUNTER1_OVERFLOW" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="TIMER_COUNTER1_CAPTURE_EVENT" value="0x07"/>
        <value caption="PSC0ASY Event" name="PSC0ASY_EVENT" value="0x08"/>
        <value caption="PSC1ASY Event" name="PSC1ASY_EVENT" value="0x09"/>
        <value caption="PSC2ASY Event" name="PSC2ASY_EVENT" value="0x0A"/>
        <value caption="Analog comparator 1" name="ANALOG_COMPARATOR_1" value="0x0B"/>
        <value caption="Analog comparator 2" name="ANALOG_COMPARATOR_2" value="0x0C"/>
      </value-group>
      <value-group caption="Analog Channel Selection Bits select" name="ANALOG_ADC_MUXPOS">
        <value caption="ADC input pin 0" name="ADC0" value="0x0"/>
        <value caption="ADC input pin 1" name="ADC1" value="0x1"/>
        <value caption="ADC input pin 2" name="ADC2" value="0x2"/>
        <value caption="ADC input pin 3" name="ADC3" value="0x3"/>
        <value caption="ADC input pin 4" name="ADC4" value="0x4"/>
        <value caption="ADC input pin 5" name="ADC5" value="0x5"/>
        <value caption="ADC input pin 6" name="ADC6" value="0x6"/>
        <value caption="ADC input pin 7" name="ADC7" value="0x7"/>
        <value caption="ADC input pin 8" name="ADC8" value="0x8"/>
        <value caption="ADC input pin 9" name="ADC9" value="0x9"/>
        <value caption="ADC input pin 10" name="ADC10" value="0xA"/>
        <value caption="Temperature sensor" name="TEMPSENSE" value="0xB"/>
        <value caption="Internal VCC / 4" name="VCC4" value="0xC"/>
        <value caption="Current source" name="ISRC" value="0xD"/>
        <value caption="Analog Differential Amplifier 0" name="AMP0" value="0xE"/>
        <value caption="Analog Differential Amplifier 1" name="AMP1" value="0xF"/>
        <value caption="Analog Differential Amplifier 2" name="AMP2" value="0x10"/>
        <value caption="Bandgap" name="BNDGAP" value="0x11"/>
        <value caption="0V (GND)" name="GND" value="0x12"/>
      </value-group>
    </module>
