pdshelley/HALGEN/atdf/ATmegaS64M1.atdf
        <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x68" size="1" ocd-rw="">
          <bitfield caption="Pin Change Interrupt Enables" mask="0x0F" name="PCIE"/>
        </register>
        <register caption="Pin Change Mask Register 3" name="PCMSK3" offset="0x6D" size="1" ocd-rw="">
          <bitfield caption="Pin Change Enable Masks" mask="0x07" name="PCINT" lsb="24"/>
        </register>
        <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6C" size="1" ocd-rw="">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="16"/>
        </register>
        <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6B" size="1" ocd-rw="">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="8"/>
        </register>
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6A" size="1" ocd-rw="">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
        </register>
        <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="">
          <bitfield caption="Pin Change Interrupt Flags" mask="0x0F" name="PCIF"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="LOW_LEVEL_OF_INTX" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="ANY_LOGICAL_CHANGE_OF_INTX" value="0x01"/>
        <value caption="Falling Edge of INTX" name="FALLING_EDGE_OF_INTX" value="0x02"/>
        <value caption="Rising Edge of INTX" name="RISING_EDGE_OF_INTX" value="0x03"/>
      </value-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x41" size="2" mask="0x07FF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="EEPROM Programming mode" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMWE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEWE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="ERASE_AND_WRITE_IN_ONE_OPERATION" value="0x00"/>
        <value caption="Erase Only" name="ERASE_ONLY" value="0x01"/>
        <value caption="Write Only" name="WRITE_ONLY" value="0x02"/>
      </value-group>
    </module>
    <module caption="Power Stage Controller" name="PSC">
      <register-group caption="Power Stage Controller" name="PSC">
        <register caption="PSC Interrupt Flag Register" name="PIFR" offset="0xBC" size="1" ocd-rw="">
          <bitfield caption="PSC External Event 2 Interrupt" mask="0x0E" name="PEV"/>
          <bitfield caption="PSC End of Cycle Interrupt" mask="0x01" name="PEOP"/>
        </register>
        <register caption="PSC Interrupt Mask Register" name="PIM" offset="0xBB" size="1" ocd-rw="">
          <bitfield caption="External Event 2 Interrupt Enable" mask="0x0E" name="PEVE"/>
          <bitfield caption="PSC End of Cycle Interrupt Enable" mask="0x01" name="PEOPE"/>
        </register>
        <register caption="PSC Module 2 Input Control Register" name="PMIC2" offset="0xBA" size="1" ocd-rw="">
          <bitfield caption="PSC Module 2 Overlap Enable" mask="0x80" name="POVEN2"/>
          <bitfield caption="PSC Module 2 Input Select" mask="0x40" name="PISEL2"/>
          <bitfield caption="PSC Module 2 Input Level Selector" mask="0x20" name="PELEV2"/>
          <bitfield caption="PSC Module 2 Input Filter Enable" mask="0x10" name="PFLTE2"/>
          <bitfield caption="PSC Module 2 Asynchronous Output Control" mask="0x08" name="PAOC2"/>
          <bitfield caption="PSC Module 2 Input Mode bits" mask="0x07" name="PRFM2"/>
        </register>
        <register caption="PSC Module 1 Input Control Register" name="PMIC1" offset="0xB9" size="1" ocd-rw="">
          <bitfield caption="PSC Module 1 Overlap Enable" mask="0x80" name="POVEN1"/>
          <bitfield caption="PSC Module 1 Input Select" mask="0x40" name="PISEL1"/>
          <bitfield caption="PSC Module 1 Input Level Selector" mask="0x20" name="PELEV1"/>
          <bitfield caption="PSC Module 1 Input Filter Enable" mask="0x10" name="PFLTE1"/>
          <bitfield caption="PSC Module 1 Asynchronous Output Control" mask="0x08" name="PAOC1"/>
          <bitfield caption="PSC Module 1 Input Mode bits" mask="0x07" name="PRFM1"/>
        </register>
        <register caption="PSC Module 0 Input Control Register" name="PMIC0" offset="0xB8" size="1" ocd-rw="">
          <bitfield caption="PSC Module 0 Overlap Enable" mask="0x80" name="POVEN0"/>
          <bitfield caption="PSC Module 0 Input Select" mask="0x40" name="PISEL0"/>
          <bitfield caption="PSC Module 0 Input Level Selector" mask="0x20" name="PELEV0"/>
          <bitfield caption="PSC Module 0 Input Filter Enable" mask="0x10" name="PFLTE0"/>
          <bitfield caption="PSC Module 0 Asynchronous Output Control" mask="0x08" name="PAOC0"/>
          <bitfield caption="PSC Module 0 Input Mode bits" mask="0x07" name="PRFM0"/>
        </register>
        <register caption="PSC Control Register" name="PCTL" offset="0xB7" size="1" ocd-rw="">
          <bitfield caption="PSC Prescaler Select bits" mask="0xC0" name="PPRE"/>
          <bitfield caption="PSC Input Clock Select" mask="0x20" name="PCLKSEL"/>
          <bitfield caption="PSC Complete Cycle" mask="0x02" name="PCCYC"/>
          <bitfield caption="PSC Run" mask="0x01" name="PRUN"/>
        </register>
        <register caption="PSC Output Configuration" name="POC" offset="0xB6" size="1" ocd-rw="">
          <bitfield caption="PSC Output 2B Enable" mask="0x20" name="POEN2B"/>
          <bitfield caption="PSC Output 2A Enable" mask="0x10" name="POEN2A"/>
          <bitfield caption="PSC Output 1B Enable" mask="0x08" name="POEN1B"/>
          <bitfield caption="PSC Output 1A Enable" mask="0x04" name="POEN1A"/>
          <bitfield caption="PSC Output 0B Enable" mask="0x02" name="POEN0B"/>
          <bitfield caption="PSC Output 0A Enable" mask="0x01" name="POEN0A"/>
        </register>
        <register caption="PSC Configuration Register" name="PCNF" offset="0xB5" size="1" ocd-rw="">
          <bitfield caption="PSC Update Lock" mask="0x20" name="PULOCK"/>
          <bitfield caption="PSC Mode" mask="0x10" name="PMODE"/>
          <bitfield caption="PSC Output B Polarity" mask="0x08" name="POPB"/>
          <bitfield caption="PSC Output A Polarity" mask="0x04" name="POPA"/>
        </register>
        <register caption="PSC Synchro Configuration" name="PSYNC" offset="0xB4" size="1" ocd-rw="">
          <bitfield caption="Selection of Synchronization Out for ADC" mask="0x30" name="PSYNC2"/>
          <bitfield caption="Selection of Synchronization Out for ADC" mask="0x0C" name="PSYNC1"/>
          <bitfield caption="Selection of Synchronization Out for ADC" mask="0x03" name="PSYNC0"/>
        </register>
