pdshelley/HALGEN/atdf/ATmegaS64M1.atdf
        <register caption="PSC Output Compare RB Register " name="POCR_RB" offset="0xB2" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 2 Output Compare SB Register " name="POCR2SB" offset="0xB0" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 2 Output Compare RA Register " name="POCR2RA" offset="0xAE" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 2 Output Compare SA Register " name="POCR2SA" offset="0xAC" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 1 Output Compare SB Register " name="POCR1SB" offset="0xAA" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 1 Output Compare RA Register " name="POCR1RA" offset="0xA8" size="2" mask="0x0FFF"/>
        <register caption="PSC Output Compare SA Register " name="POCR1SA" offset="0xA6" size="2" mask="0x0FFF"/>
        <register caption="PSC Output Compare SB Register " name="POCR0SB" offset="0xA4" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 0 Output Compare RA Register " name="POCR0RA" offset="0xA2" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 0 Output Compare SA Register " name="POCR0SA" offset="0xA0" size="2" mask="0x0FFF"/>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="CQFP32TQFP32" caption="CQFP32TQFP32">
      <pin position="1" pad="PD2"/>
      <pin position="2" pad="PD3"/>
      <pin position="3" pad="PC1"/>
      <pin position="4" pad="VCC"/>
      <pin position="5" pad="GND"/>
      <pin position="6" pad="PC2"/>
      <pin position="7" pad="PC3"/>
      <pin position="8" pad="PB0"/>
      <pin position="9" pad="PB1"/>
      <pin position="10" pad="PE1"/>
      <pin position="11" pad="PE2"/>
      <pin position="12" pad="PD4"/>
      <pin position="13" pad="PD5"/>
      <pin position="14" pad="PD6"/>
      <pin position="15" pad="PD7"/>
      <pin position="16" pad="PB2"/>
      <pin position="17" pad="PC4"/>
      <pin position="18" pad="PC5"/>
      <pin position="19" pad="AVCC"/>
      <pin position="20" pad="AGND"/>
      <pin position="21" pad="AREF"/>
      <pin position="22" pad="PC6"/>
      <pin position="23" pad="PB3"/>
      <pin position="24" pad="PB4"/>
      <pin position="25" pad="PC7"/>
      <pin position="26" pad="PB5"/>
      <pin position="27" pad="PB6"/>
      <pin position="28" pad="PB7"/>
      <pin position="29" pad="PD0"/>
      <pin position="30" pad="PC0"/>
      <pin position="31" pad="PE0"/>
      <pin position="32" pad="PD1"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
